/*
 * Написать промис, который сразу зарезолвится и вернет число в resolve
 * Создать на нем цепочку из 3 then. В каждом увеличивать предыдущее число вдвое.
 * В конце вывести полученное число в консоль.
 *
 * Переделайте предыдущую задачу так, чтобы один из промисов в цепочке выполнился с ошибкой (два способа)
 * В конце цепочки расположите метод catch, который поймает эту ошибку.
 * В конце вывести сообщение о том, что цепочка закончила выполнение.
 * Переместить метод catch в середину цепочки.
 */
