/*
 * Создать функцию getData, которая принимает два колбека на случай успешного выполнения задачи (`We did it - ${msg}`) и на случай ошибки (`We've got some error - ${err}`).
 * Задача должна случайным образом выполняться с задержкой в 1 секунду.
 * Если успешно передать в колбек '🟢 SUCCESS!', если нет - '🔴 ERROR!'

 * Переписать на промис (сначала с двумя колбеками в then, потом с catch)
 * Использовать анонимные колбеки / именованные с явным вызовом / именованные с передачей ссылки
 * При любом результате в конце выводить 'Finished!
*/

// const isSuccess = Math.random() < 0.5; // Случайное условие

//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//

///////////////////////////////////////////////////////////////////////

/*
 * Есть функция, которая генерирует случайные числа от 1 до 4.
 * Написать функцию, которая возвращает промис.
 * Сделайте так, чтобы сгенерированное число было задержкой функции setTimeout в секундах.
 * Оберните все это в промис, который в любом случае возвращает время задержки (и в resolve, и в reject).
 * Пусть промис выполнится успешно, если сгенерировано 1 или 2 (`🟢 Resolved after ${delay} sec`), и с ошибкой - если 3 или 4 (`🔴 Rejected after ${delay} sec`).
 * Использовать анонимные колбеки / именованные с явным вызовом / именованные с передачей ссылки
 */

// const getRandomNumber = () => Math.floor(Math.random() * 4) + 1;
